# <font color=blue>Assignment for "Grouping and Aggregation Operations on DataFrames"</font>

For Pandas assignments, you are going to use [Titanic](https://www.kaggle.com/c/titanic/download/GQf0y8ebHO0C4JXscPPp%2Fversions%2FXkNkvXwqPPVG0Qt3MtQT%2Ffiles%2Ftrain.csv) (train.csv) dataset. Download the dataset and load to a data frame.

1. Calculate the average age of the passengers for each gender and passenger class by using `groupby()` method.

In [2]:
import pandas as pd
import numpy as np

mydata= pd.read_csv("E:/user/Notebooks/data/train.csv")
mydata.groupby(by=["Sex","Pclass"])["Age"].mean()

Sex     Pclass
female  1         34.611765
        2         28.722973
        3         21.750000
male    1         41.281386
        2         30.740707
        3         26.507589
Name: Age, dtype: float64

2. Group by embarkation port and print values. (Notice that you get unique values with this.)

In [3]:
mydata.groupby(by=["Embarked"]).mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Embarked,,,,,,,
C,445.357143,0.553571,1.886905,30.814769,0.386905,0.363095,59.954144
Q,417.896104,0.389610,2.909091,28.089286,0.428571,0.168831,13.276030
S,449.527950,0.336957,2.350932,29.445397,0.571429,0.413043,27.079812